server/app/controllers/users_controller.rb

INSERT INTO "skills" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2015-02-19 22:33:12.039617"], ["name", "sql"], ["updated_at", "2015-02-19 22:33:12.039617"]]
SELECT  "skills".* FROM "skills"  WHERE "skills"."name" = 'sql' LIMIT 1
INSERT INTO "users" ("created_at", "email", "name", "password_hash", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
	def create
		user = User.new(user_params)

		skill_params.each do |skill, value|
			if value == true
				current_skill = Skill.find_or_create_by(name: skill)
				user.skills << current_skill